Revit 2026 API

# ConnectorRadius Property

---

The radius of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual double Radius { get; set; }
```
```vb
Public Overridable Property Radius As Double
	Get
	Set
```
```cpp
public:
virtual property double Radius {
	double get ();
	void set (double value);
}
```
```fsharp
abstract Radius : float with get, set
override Radius : float with get, set
```

#### Property Value

Double

#### Implements

IConnectorRadius

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's shape is not round. |
| ArgumentException | Thrown when the argument is invalid. |
| InvalidOperationException | Thrown on failure to set radius. |

In order to set this property, it must be mapped to a writable instance parameter in the family definition.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace